---
kind: type
id: T:Autodesk.Revit.DB.Architecture.CutLineType
source: html/3dc12e49-711d-cdba-0d16-6b43302a03fd.htm
---
# Autodesk.Revit.DB.Architecture.CutLineType

The available line types for a stairs cut line.

## Syntax (C#)
```csharp
public enum CutLineType
```